---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfigurationInfo.GetProfiles
source: html/5f5ee020-16fb-ada3-dee2-5b999c1cd643.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.GetProfiles Method

Return the profiles in the fabrication configuration.

## Syntax (C#)
```csharp
public IList<string> GetProfiles()
```

## Remarks
The global profile name is empty, and is not returned here.